#include <stdio.h>

void countCall(){     //ประกาศตัวเเปรเเบบปกติ (non-stastic) จะถูกรีเซ็ตใหม่ทุกครั้ง
    int counter = 0;
    counter++;    //เเสดงค่าของ counter ซี่งจะ่ป็น 1 ทุกครั้งที่เรียกฟังก์ชัน
    printf("Call Function: Counter = %d\n", counter);
}

int main(){
    printf("Starting function call...\n");
    countCall();     // ครั้งที่ 1 => counter = 1
    printf("After first call:\n");
    countCall();     // ครั้งที่ 2 => counter = 2
    return 0;
}
/* 1. ผลลัพะ์ที่ได้ต่างกันอย่างไร? เพราะเหตุใด?
- กรณีที่ 1 (static): ผลลัพะ์จะเพิ่มขึ้นทุกครั้งที่เรียก เช่น 1,2
- กรณี่ 2 (non static): ค่าจะเริ่มที่ 1 ทุกครั้ง เช่น 1,1
เพราะ static จะเก็บค่าตัวเเปรไว้ในหน่วยความจำตลอดโปรเเกรมส่วน non-static จะสร้างตัวเเปรใหม่ทุกครั้งที่เรียกฟังก์ชัน
2.ความเเตกต่างของ non-static variable?
-ตัวเเปร non-static จะมีอายุเเค่ภายในฟังก์ชันที่ถูกเรียก
-จะรีเซ็ตใหม่ทุกครั้ง ไม่สามารถจำค่าครั้งก่อนได้
-เหมาะสมกับงานที่ไม่ต้องใช้ค่าต่อเนื่องระหว่างการเรียกฟังก์ชัน
3.อภิปรายเเละสรุปผลที่ได้จากการทดลอง:
-static เหมาะสมสำหรับงานที่ต้องการเก็บค่าสถานะต่อเนื่อง เช่น นับจำนวนรอบ
-non static เหมาะกับงานที่ต้องการรีเซ็ตค่าทุกครั้ง เช่น การคำนวณเฉพาะรอบ
-การเข้าใจเเละเลือกใช้ static หรือ non static อย่างเหมาะสม จะช่วยในโปรเเกรมทำงานได้ตรงตามอุปกรณ์
*/