#include <stdio.h> //เรียกใช้ไลบรารี standard input/output (stdio.h) ซึ่งเป็นส่วนสำคัญสำหรับฟังก์ชันการรับเเละเเสดงผลข้อมูล เช่น print()

int main(){
    //เเสดงผลอักษร 'a' ตามด้วยตัวเลขทศนิยม 3 ตำเเหน่งเเละเว้นช่องว่าง 6 ตัว
    printf("a=%6.3f%%\n", 0.617);
    //เเสดงผลอักษร 'b' ตามด้วยตัวเลขทศนิยม 4  หลัก (เติม 0 ข้างหน้า) เเละเครื่องกาย %
    printf("b=%4d%%\n", 25);
    //เเสดงผลอักษร 'c' ตามด้วยตัวเลขทศนิยม 3 โดยเว้นช่องว่าง 6 ตัวทางซ้าย
    printf("c= %d%%\n", 19.000);
    //เเสดงผลอักษร 'd' ตามด้วยตัวเลขจำนวนเต็ม 2 หลัก โดยจัดชินซ้ายเเละมีเครื่องหมาย %
    printf("d= %d%%\n", 9);
    //เเสดงผลอักษร 'e' ตามด้วยตัวเลขทศนิยม 3 โดยเว้นช่องว่าง 7 ตัวทางซ้าย
    printf("e= %7.3f%%\n", 124.555);
    //เเสดงผลอักษร 'f' ตามด้วยตัวเลขทศนิยม 3 โดยเว้นช่องว่าง 5 ตัวทางซ้าย
    printf("f= %5.3f%%\n", 0.001);

    return 0;     // คืนค่า 0 เพื่อบอกระบบปฏิบัติการว่าโปรเเกรมทำงานเสร็จสมบูรณ์โดยไม่มีข้อผิดพลาดเกิดขึ้น
    
}
    